# 省份
provinces = ['江西', '江苏', '上海', '重庆', '天津', '安徽', '北京', '福建', '甘肃', '广西', '山西', '海南', '河南', '黑龙江',
             '湖北', '吉林', '辽宁', '内蒙古', '内蒙', '青海', '陕西', '四川', '浙江', '厦门', '河北', '湖南', '云南', '']
# 运营商
operators = ['电信', '移动', '联通']

# 年份
years = ['2015', '2016', '2017', '2018', '2019', '2020']

# localhost db
host = 'localhost'
database = 'process'
user = 'root'
password = '123456'
port = 3306

# 服务器 db
# host = '192.168.10.231'
# database = 'assess'
# user = 'bj'
# password = 'bj2016'
# port = 3307

chapter_number_map = {
    '一': '1',
    '二': '2',
    '三': '3',
    '四': '4',
    '五': '5',
    '六': '6',
    '七': '7',
    '八': '8',
    '九': '9',
    '十': '10',
    '十一': '11',
    '十二': '12',
    '十三': '13'
}

'''
    v1 -    2017年江苏移动
            2017年江西移动
            2018江西移动15个报告
            2018年江西联通
            重庆电信2018年8月
            上海联通2017年
            其他 - 江西省一保通医联万家业务信息安全评估报告
            网约车 - 江南出行平台业务信息安全评估报告
            
    v2 -    网约车 - 江西幸福汽车服务有限公司幸福专车业务信息安全评估报告20181101
            网约车 - 江西易至智行汽车运营服务有限公司20190805
            网约车 - 联途出行信息安全评估报告
            
    v3 -    其他 - “江西机关党建APP”安全评估报告
            
    已完成文件夹：2017年江苏移动
                2017年江西移动
                2018江西移动15个报告
                2018年江西联通
                重庆电信2018年8月
                上海联通2017年
                网约车
                
'''
# 数据库字段映射   （2017，2018)
fields_map_v1 = {
    '(1.1\s?业务名称)': ['业务名称', '1.1'],
    '(1.2\s?业务功能介绍)': ['业务功能介绍', '1.2'],
    '(1.3\s?技术实现方式介绍)': ['技术实现方式介绍', '1.3'],
    '(1.4\s?（预期）用户规模)': ['（预期）用户规模', '1.4'],
    '(1.5\s?市场发展情况)': ['市场发展情况', '1.5'],
    '(2.1\s?安全评估情况概述)': ['安全评估情况概述', '2.1'],
    '(2.2\s?评估人员组成)': ['评估人员组成', '2.2'],
    '(2.3\s?评估实施流程)': ['评估实施流程', '2.3'],
    '(3.1\s?安全风险分析表)': ['安全风险分析表', '3.1'],
    '(3.2\s?风险说明)': ['风险说明', '3.2'],
    '(4.1\s?日常安全管理介绍)': ['日常安全管理介绍', '4.1'],
    '(4.2\s?应急管理措施介绍)': ['应急管理措施介绍', '4.2'],
    '(4.3\s?安全保障能力分析表)': ['安全保障能力分析表', '4.3'],
    '(4.4\s?安全保障能力说明)': ['安全保障能力说明', '4.4'],
    '(5.1\s?信息安全管理风险评估结果)': ['信息安全管理风险评估结果', '5.1'],
    '(5.2\s?信息内容安全风险评估结果)': ['信息内容安全风险评估结果', '5.2'],
    '(5.3\s?用户信息安全风险评估结果|5.3\s?业务平台安全风险评估结果)': ['用户信息安全风险评估结果_or_业务平台安全风险评估结果', '5.3'],
    '(5.4\s?业务平台安全风险评估结果|5.4\s?业务运行安全风险评估结果)': ['业务平台安全风险评估结果_or_业务运行安全风险评估结果', '5.4'],
    '(6\s?安全评估结论意见)': ['安全评估结论意见', '6']
}
# 文档提取规则    （2017，2018）
match_list_v1 = [
    ['(1.1\s?业务名称)', '(1.2\s?业务功能介绍)'],
    ['(1.2\s?业务功能介绍)', '(1.3\s?技术实现方式介绍)'],
    ['(1.3\s?技术实现方式介绍)', '(1.4\s?（预期）用户规模)'],
    ['(1.4\s?（预期）用户规模)', '(1.5\s?市场发展情况)'],
    ['(1.5\s?市场发展情况)', '(2\s?安全评估情况)'],
    ['(2.1\s?安全评估情况概述)', '(2.2\s?评估人员组成)'],
    ['(2.2\s?评估人员组成)', '(2.3\s?评估实施流程)'],
    ['(2.3\s?评估实施流程)', '(3\s?业务安全风险分析)'],
    ['(3.1\s?安全风险分析表)', '(3.2\s?风险说明)'],
    ['(3.2\s?风险说明)', '(4\s?配套安全管理措施)'],
    ['(4.1\s?日常安全管理介绍)', '(4.2\s?应急管理措施介绍)'],
    ['(4.2\s?应急管理措施介绍)', '(4.3\s?安全保障能力分析表)'],
    ['(4.3\s?安全保障能力分析表)', '(4.4\s?安全保障能力说明)'],
    ['(4.4\s?安全保障能力说明)', '(5\s?评估结果|5\s?评估结果及整改建议)'],
    ['(5.1\s?信息安全管理风险评估结果)', '(5.2\s?信息内容安全风险评估结果|5.4\s?业务平台安全风险评估结果)'],  # 2017江苏
    ['(5.2\s?信息内容安全风险评估结果)', '(5.3\s?用户信息安全风险评估结果|5.3\s?业务平台安全风险评估结果)'],  # 2018
    ['(5.3\s?用户信息安全风险评估结果|5.3\s?业务平台安全风险评估结果)', '(5.4\s?业务平台安全风险评估结果|5.4\s?业务运行安全风险评估结果)'],
    ['(5.4\s?业务平台安全风险评估结果|5.4\s?业务运行安全风险评估结果)', '(6\s?安全评估结论意见|5.5\s?匹配性控制分析)'],  # 2018重庆
    ['(6\s?安全评估结论意见)', '\s'],
    # ['(附件)', '']   # 附件未处理
]

# 数据库字段映射   （网约车后三个）
fields_map_v2 = {
    '(1.1\s?业务名称)': ['业务名称', '1.1'],
    '(1.2\s?业务功能介绍)': ['业务功能介绍', '1.2'],
    '(1.3\s?技术实现方式介绍)': ['技术实现方式介绍', '1.3'],
    '(1.4\s?（预期）用户规模)': ['（预期）用户规模', '1.4'],
    '(1.5\s?市场发展情况)': ['市场发展情况', '1.5'],
    '(2.1\s?安全评估情况概述)': ['安全评估情况概述', '2.1'],
    '(2.2\s?评估实施流程)': ['评估实施流程', '2.2'],
    '(3.1\s?安全风险分析表)': ['安全风险分析表', '3.1'],
    '(3.2\s?风险说明)': ['风险说明', '3.2'],
    '(4.1\s?日常安全管理介绍)': ['日常安全管理介绍', '4.1'],
    '(4.2\s?应急管理措施介绍)': ['应急管理措施介绍', '4.2'],
    '(4.3\s?安全保障能力分析表)': ['安全保障能力分析表', '4.3'],
    '(4.4\s?安全保障能力说明)': ['安全保障能力说明', '4.4'],
    '(5.1\s?信息安全管理风险评估结果)': ['信息安全管理风险评估结果', '5.1'],
    '(5.2\s?信息内容安全风险评估结果)': ['信息内容安全风险评估结果', '5.2'],
    '(5.3\s?业务平台安全风险评估结果)': ['业务平台安全风险评估结果', '5.3'],
    '(5.4\s?业务运行安全风险评估结果)': ['业务运行安全风险评估结果', '5.4'],
    '(6\s?安全评估结论意见)': ['安全评估结论意见', '6'],
    '(7\s?整改情况及及复核结论)': ['整改情况及复核结论', '7']
}

# 文档提取规则   （网约车后三个）
match_list_v2 = [
    ['(1.1\s?业务名称)', '(1.2\s?业务功能介绍)'],
    ['(1.2\s?业务功能介绍)', '(1.3\s?技术实现方式介绍)'],
    ['(1.3\s?技术实现方式介绍)', '(1.4\s?（预期）用户规模)'],
    ['(1.4\s?（预期）用户规模)', '(1.5\s?市场发展情况)'],
    ['(1.5\s?市场发展情况)', '(2\s?安全评估情况)'],
    ['(2.1\s?安全评估情况概述)', '(2.2\s?评估实施流程)'],
    ['(2.2\s?评估实施流程)', '(3\s?业务安全风险分析)'],
    ['(3.1\s?安全风险分析表)', '(3.2\s?风险说明)'],
    ['(3.2\s?风险说明)', '(4\s?配套安全管理措施)'],
    ['(4.1\s?日常安全管理介绍)', '(4.2\s?应急管理措施介绍)'],
    ['(4.2\s?应急管理措施介绍)', '(4.3\s?安全保障能力分析表)'],
    ['(4.3\s?安全保障能力分析表)', '(4.4\s?安全保障能力说明)'],
    ['(4.4\s?安全保障能力说明)', '(5\s?评估结果及整改建议)'],
    ['(5.1\s?信息安全管理风险评估结果)', '(5.2\s?信息内容安全风险评估结果)'],
    ['(5.2\s?信息内容安全风险评估结果)', '(5.3\s?业务平台安全风险评估结果)'],
    ['(5.3\s?业务平台安全风险评估结果)', '(5.4\s?业务运行安全风险评估结果)'],
    ['(5.4\s?业务运行安全风险评估结果)', '(6\s?安全评估结论意见)'],
    ['(6\s?安全评估结论意见)', '(7\s?整改情况及及复核结论)'],
    ['(7\s?整改情况及及复核结论)', '\s'],
    # ['(附件)', '']   # 附件未处理
]

# 数据库字段映射   （其他 - “江西机关党建APP”安全评估报告）
fields_map_v3 = {
    '(1.1\s?业务名称)': ['业务名称', '1.1'],
    '(1.2\s?业务功能介绍)': ['业务功能介绍', '1.2'],
    '(1.3\s?技术实现方式介绍)': ['技术实现方式介绍', '1.3'],
    '(1.4\s?（预期）用户规模)': ['（预期）用户规模', '1.4'],
    '(1.5\s?市场发展情况)': ['市场发展情况', '1.5'],
    '(2.1\s?安全评估情况概述)': ['安全评估情况概述', '2.1'],
    '(2.2\s?评估实施流程)': ['评估实施流程', '2.2'],
    '(3.1\s?安全风险分析表)': ['安全风险分析表', '3.1'],
    '(3.2\s?风险说明)': ['风险说明', '3.2'],
    '(4.1\s?日常安全管理介绍)': ['日常安全管理介绍', '4.1'],
    '(4.2\s?应急管理措施介绍)': ['应急管理措施介绍', '4.2'],
    '(4.3\s?安全保障能力分析表)': ['安全保障能力分析表', '4.3'],
    '(4.4\s?安全保障能力说明)': ['安全保障能力说明', '4.4'],
    '(5.1\s?信息安全管理风险评估结果)': ['信息安全管理风险评估结果', '5.1'],
    '(5.2\s?信息内容安全风险评估结果)': ['信息内容安全风险评估结果', '5.2'],
    '(5.3\s?业务平台安全风险评估结果)': ['业务平台安全风险评估结果', '5.3'],
    '(5.4\s?业务运行安全风险评估结果)': ['业务运行安全风险评估结果', '5.4'],
    '(6\s?安全评估结论意见)': ['安全评估结论意见', '6'],
    '(7\s?整改情况及及复核结论)': ['整改情况及复核结论', '7']
}

# 文档提取规则   （其他 - “江西机关党建APP”安全评估报告）
match_list_v3 = [
    ['(1.1\s?业务名称)', '(1.2\s?业务功能介绍)'],
    ['(1.2\s?业务功能介绍)', '(1.3\s?技术实现方式介绍)'],
    ['(1.3\s?技术实现方式介绍)', '(1.4\s?（预期）用户规模)'],
    ['(1.4\s?（预期）用户规模)', '(1.5\s?市场发展情况)'],
    ['(1.5\s?市场发展情况)', '(2\s?安全评估情况)'],
    ['(2.1\s?安全评估情况概述)', '(2.2\s?评估实施流程)'],
    ['(2.2\s?评估实施流程)', '(3\s?业务安全风险分析)'],
    ['(3.1\s?安全风险分析表)', '(3.2\s?风险说明)'],
    ['(3.2\s?风险说明)', '(4\s?配套安全管理措施)'],
    ['(4.1\s?日常安全管理介绍)', '(4.2\s?应急管理措施介绍)'],
    ['(4.2\s?应急管理措施介绍)', '(4.3\s?安全保障能力分析表)'],
    ['(4.3\s?安全保障能力分析表)', '(4.4\s?安全保障能力说明)'],
    ['(4.4\s?安全保障能力说明)', '(5\s?评估结果及整改建议)'],
    ['(5.1\s?信息安全管理风险评估结果)', '(5.2\s?信息内容安全风险评估结果)'],
    ['(5.2\s?信息内容安全风险评估结果)', '(5.3\s?业务平台安全风险评估结果)'],
    ['(5.3\s?业务平台安全风险评估结果)', '(5.4\s?业务运行安全风险评估结果)'],
    ['(5.4\s?业务运行安全风险评估结果)', '(6\s?安全评估结论意见)'],
    ['(6\s?安全评估结论意见)', '(7\s?整改情况及及复核结论)'],
    ['(7\s?整改情况及及复核结论)', '\s'],
    # ['(附件)', '']   # 附件未处理
]

