import pymongo


db_name = 'military_qa'
col_name = 'data'


client = pymongo.MongoClient()
col = client[db_name][col_name]

# 模糊查询AK47
results = col.find({'名称': {'$regex': '.*A.*K.*4.*7'}})
for result in results:
    print(result)
print()

unit_dict = {
    '海里': [1852, '米'],
    '英里': [1610, '米'],
    '/节': [1852, '米'],
    'km/节': [1000, '米'],
    '吨': [1000, '千克'],
    '-吨': [1000, '千克'],
    '公里': [1000, '米'],
    '公里/节': [1000, '米'],
    '公里/小时': [1000, '米'],
    '海里节': [1852, '米'],
    '海里，节': [1852, '米'],
    '海里/节': [1852, '米'],
    '海哩/节': [1852, '米'],
    '海浬/节': [1852, '米'],
    '毫米': [0.001, '米'],
    '节': [1852, '米'],
    '节/海里': [1852, '米'],
    '节海里': [1852, '米'],
    '节行驶英里': [1852, '米'],
    '节下海里': [1852, '米'],
    '克': [0.001, '千克'],
    '里': [1852, '米'],
    '里/节': [1852, '米'],
    '米': [1, '米'],
    '千克': [1, '克'],
    '千米': [1000, '米'],
    '千米/节': [1000, '米'],
    '千米/时': [1000, '米'],
    '千米/小时': [1000, '米'],
    '千米每小时': [1000, '米'],
    '万海里/节': [18520000, '米'],
    '英里，节': [1610, '米'],
    '英里/节': [1610, '米'],
    '余英里': [1610, '米'],
    '约海里': [1852, '米'],
    '最大海里': [1852, '米'],
    '厘米': [0.01, '米'],
    '分米': [0.1, '米'],
    '人': [1, '人'],
    '位': [1, '位']}

unit_dict = {i: len(i) for i in unit_dict}
print(unit_dict)
unit_wds = [i[0] for i in sorted(unit_dict.items(), key=lambda asd: asd[1], reverse=True)]

print(unit_wds)

unit_regex = '([0-9]+.?[0-9]+)(%s)+' % '|'.join(unit_wds)
print(unit_regex)

dic = {
    '哈哈': '呵呵',
    '呜呜': '嘿嘿'
}


